espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_struct_mp.h
/** Type of imm_i2c_iso register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** tie_high_i2c_iso_en : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t tie_high_i2c_iso_en:1;
        /** tie_low_i2c_iso_en : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tie_low_i2c_iso_en:1;
    };
    uint32_t val;
} pmu_imm_i2c_iso_reg_t;

/** Type of power_wait_timer0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** dg_hp_powerdown_timer : R/W; bitpos: [13:5]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_powerdown_timer:9;
        /** dg_hp_powerup_timer : R/W; bitpos: [22:14]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_powerup_timer:9;
        /** dg_hp_pd_wait_timer : R/W; bitpos: [31:23]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_pd_wait_timer:9;
    };
    uint32_t val;
} pmu_power_wait_timer0_reg_t;

/** Type of power_wait_timer1 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:9;
        /** dg_lp_powerdown_timer : R/W; bitpos: [15:9]; default: 63;
         *  need_des
         */
        uint32_t dg_lp_powerdown_timer:7;
        /** dg_lp_powerup_timer : R/W; bitpos: [22:16]; default: 63;
         *  need_des
         */
        uint32_t dg_lp_powerup_timer:7;
        /** dg_lp_pd_wait_timer : R/W; bitpos: [31:23]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_pd_wait_timer:9;
    };
    uint32_t val;
} pmu_power_wait_timer1_reg_t;

/** Type of power_wait_timer2 register
 *  need_des
 */
typedef union {
    struct {
        /** dg_lp_iso_wait_timer : R/W; bitpos: [7:0]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_iso_wait_timer:8;
        /** dg_lp_rst_wait_timer : R/W; bitpos: [15:8]; default: 255;
         *  need_des
         */
        uint32_t dg_lp_rst_wait_timer:8;
        /** dg_hp_iso_wait_timer : R/W; bitpos: [23:16]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_iso_wait_timer:8;
        /** dg_hp_rst_wait_timer : R/W; bitpos: [31:24]; default: 255;
         *  need_des
         */
        uint32_t dg_hp_rst_wait_timer:8;
    };
    uint32_t val;
} pmu_power_wait_timer2_reg_t;

/** Type of power_pd_top_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_top_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_top_reset:1;
        /** force_top_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_top_iso:1;
        /** force_top_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_top_pu:1;
        /** force_top_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_top_no_reset:1;
        /** force_top_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_top_no_iso:1;
        /** force_top_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_top_pd:1;
        /** pd_top_mask : R/W; bitpos: [10:6]; default: 0;
         *  need_des
         */
        uint32_t pd_top_mask:5;
        uint32_t reserved_11:16;
        /** pd_top_pd_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_top_pd_mask:5;
    };
    uint32_t val;
} pmu_power_pd_top_cntl_reg_t;

/** Type of power_pd_hpaon_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_aon_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_aon_reset:1;
        /** force_hp_aon_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_aon_iso:1;
        /** force_hp_aon_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_aon_pu:1;
        /** force_hp_aon_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_aon_no_reset:1;
        /** force_hp_aon_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_aon_no_iso:1;
        /** force_hp_aon_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_aon_pd:1;
        /** pd_hp_aon_mask : R/W; bitpos: [10:6]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_aon_mask:5;
        uint32_t reserved_11:16;
        /** pd_hp_aon_pd_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_aon_pd_mask:5;
    };
    uint32_t val;
} pmu_power_pd_hpaon_cntl_reg_t;

/** Type of power_pd_hpcpu_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_cpu_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_reset:1;
        /** force_hp_cpu_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_iso:1;
        /** force_hp_cpu_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_pu:1;
        /** force_hp_cpu_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_no_reset:1;
        /** force_hp_cpu_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_cpu_no_iso:1;
        /** force_hp_cpu_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_cpu_pd:1;
        /** pd_hp_cpu_mask : R/W; bitpos: [10:6]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_cpu_mask:5;
        uint32_t reserved_11:16;
        /** pd_hp_cpu_pd_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_cpu_pd_mask:5;
    };
    uint32_t val;
} pmu_power_pd_hpcpu_cntl_reg_t;

