espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_struct_mp.h
/** Type of power_pd_hpperi_reserve register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_peri_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_peri_reset:1;
        /** force_hp_peri_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_peri_iso:1;
        /** force_hp_peri_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_peri_pu:1;
        /** force_hp_peri_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_peri_no_reset:1;
        /** force_hp_peri_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_peri_no_iso:1;
        /** force_hp_peri_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_peri_pd:1;
        /** pd_hp_peri_mask : R/W; bitpos: [10:6]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_peri_mask:5;
        uint32_t reserved_11:16;
        /** pd_hp_peri_pd_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_peri_pd_mask:5;
    };
    uint32_t val;
} pmu_power_pd_hpperi_reserve_reg_t;

/** Type of power_pd_hpwifi_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_wifi_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_wifi_reset:1;
        /** force_hp_wifi_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_wifi_iso:1;
        /** force_hp_wifi_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_hp_wifi_pu:1;
        /** force_hp_wifi_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_hp_wifi_no_reset:1;
        /** force_hp_wifi_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_hp_wifi_no_iso:1;
        /** force_hp_wifi_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_hp_wifi_pd:1;
        /** pd_hp_wifi_mask : R/W; bitpos: [10:6]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_wifi_mask:5;
        uint32_t reserved_11:16;
        /** pd_hp_wifi_pd_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_wifi_pd_mask:5;
    };
    uint32_t val;
} pmu_power_pd_hpwifi_cntl_reg_t;

/** Type of power_pd_lpperi_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_lp_peri_reset : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_lp_peri_reset:1;
        /** force_lp_peri_iso : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_lp_peri_iso:1;
        /** force_lp_peri_pu : R/W; bitpos: [2]; default: 1;
         *  need_des
         */
        uint32_t force_lp_peri_pu:1;
        /** force_lp_peri_no_reset : R/W; bitpos: [3]; default: 1;
         *  need_des
         */
        uint32_t force_lp_peri_no_reset:1;
        /** force_lp_peri_no_iso : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t force_lp_peri_no_iso:1;
        /** force_lp_peri_pd : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t force_lp_peri_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} pmu_power_pd_lpperi_cntl_reg_t;

/** Type of power_pd_mem_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_mem_iso : R/W; bitpos: [3:0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_mem_iso:4;
        /** force_hp_mem_pd : R/W; bitpos: [7:4]; default: 0;
         *  need_des
         */
        uint32_t force_hp_mem_pd:4;
        uint32_t reserved_8:16;
        /** force_hp_mem_no_iso : R/W; bitpos: [27:24]; default: 15;
         *  need_des
         */
        uint32_t force_hp_mem_no_iso:4;
        /** force_hp_mem_pu : R/W; bitpos: [31:28]; default: 15;
         *  need_des
         */
        uint32_t force_hp_mem_pu:4;
    };
    uint32_t val;
} pmu_power_pd_mem_cntl_reg_t;

/** Type of power_pd_mem_mask register
 *  need_des
 */
typedef union {
    struct {
        /** pd_hp_mem2_pd_mask : R/W; bitpos: [4:0]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem2_pd_mask:5;
        /** pd_hp_mem1_pd_mask : R/W; bitpos: [9:5]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem1_pd_mask:5;
        /** pd_hp_mem0_pd_mask : R/W; bitpos: [14:10]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem0_pd_mask:5;
        uint32_t reserved_15:2;
        /** pd_hp_mem2_mask : R/W; bitpos: [21:17]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem2_mask:5;
        /** pd_hp_mem1_mask : R/W; bitpos: [26:22]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem1_mask:5;
        /** pd_hp_mem0_mask : R/W; bitpos: [31:27]; default: 0;
         *  need_des
         */
        uint32_t pd_hp_mem0_mask:5;
    };
    uint32_t val;
} pmu_power_pd_mem_mask_reg_t;

/** Type of power_hp_pad register
 *  need_des
 */
typedef union {
    struct {
        /** force_hp_pad_no_iso_all : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t force_hp_pad_no_iso_all:1;
        /** force_hp_pad_iso_all : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t force_hp_pad_iso_all:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pmu_power_hp_pad_reg_t;

/** Type of power_flash1p8_ldo register
 *  need_des
 */
typedef union {
    struct {
        /** flash1p8_ldo_rdy : RO; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t flash1p8_ldo_rdy:1;
        /** flash1p8_sw_en_xpd : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_sw_en_xpd:1;
        /** flash1p8_sw_en_thru : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_sw_en_thru:1;
        /** flash1p8_sw_en_standby : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_sw_en_standby:1;
        /** flash1p8_sw_en_power_adjust : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_sw_en_power_adjust:1;
        /** flash1p8_sw_en_endet : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_sw_en_endet:1;
        uint32_t reserved_6:16;
        /** flash1p8_bypass_ldo_rdy : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_bypass_ldo_rdy:1;
        /** flash1p8_xpd : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_xpd:1;
        /** flash1p8_thru : R/W; bitpos: [24]; default: 1;
         *  need_des
         */
        uint32_t flash1p8_thru:1;
        /** flash1p8_standby : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_standby:1;
        /** flash1p8_power_adjust : R/W; bitpos: [29:26]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_power_adjust:4;
        uint32_t reserved_30:1;
        /** flash1p8_endet : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t flash1p8_endet:1;
    };
    uint32_t val;
} pmu_power_flash1p8_ldo_reg_t;

/** Type of power_flash1p2_ldo register
 *  need_des
 */
typedef union {
    struct {
        /** flash1p2_ldo_rdy : RO; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t flash1p2_ldo_rdy:1;
        /** flash1p2_sw_en_xpd : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_sw_en_xpd:1;
        /** flash1p2_sw_en_thru : R/W; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_sw_en_thru:1;
        /** flash1p2_sw_en_standby : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_sw_en_standby:1;
        /** flash1p2_sw_en_power_adjust : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_sw_en_power_adjust:1;
        /** flash1p2_sw_en_endet : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_sw_en_endet:1;
        uint32_t reserved_6:16;
        /** flash1p2_bypass_ldo_rdy : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_bypass_ldo_rdy:1;
        /** flash1p2_xpd : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_xpd:1;
        /** flash1p2_thru : R/W; bitpos: [24]; default: 1;
         *  need_des
         */
        uint32_t flash1p2_thru:1;
        /** flash1p2_standby : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_standby:1;
        /** flash1p2_power_adjust : R/W; bitpos: [29:26]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_power_adjust:4;
        uint32_t reserved_30:1;
        /** flash1p2_endet : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t flash1p2_endet:1;
    };
    uint32_t val;
} pmu_power_flash1p2_ldo_reg_t;

/** Type of power_vdd_flash register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:22;
        /** flash_ldo_sw_en_tiel : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_sw_en_tiel:1;
        /** flash_ldo_power_sel : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_power_sel:1;
        /** flash_ldo_sw_en_power_sel : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_sw_en_power_sel:1;
        /** flash_ldo_wait_target : R/W; bitpos: [28:25]; default: 15;
         *  need_des
         */
        uint32_t flash_ldo_wait_target:4;
        /** flash_ldo_tiel_en : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_tiel_en:1;
        /** flash_ldo_tiel : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_tiel:1;
        /** flash_ldo_sw_update : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t flash_ldo_sw_update:1;
    };
    uint32_t val;
} pmu_power_vdd_flash_reg_t;

/** Type of power_io_ldo register
 *  need_des
 */
typedef union {
    struct {
        /** io_ldo_rdy : RO; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t io_ldo_rdy:1;
        /** io_sw_en_xpd : R/W; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t io_sw_en_xpd:1;
        uint32_t reserved_2:1;
        /** io_sw_en_thru : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t io_sw_en_thru:1;
        /** io_sw_en_standby : R/W; bitpos: [4]; default: 0;
         *  need_des
         */
        uint32_t io_sw_en_standby:1;
        /** io_sw_en_power_adjust : R/W; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t io_sw_en_power_adjust:1;
        /** io_sw_en_endet : R/W; bitpos: [6]; default: 0;
         *  need_des
         */
        uint32_t io_sw_en_endet:1;
        uint32_t reserved_7:15;
        /** io_bypass_ldo_rdy : R/W; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t io_bypass_ldo_rdy:1;
        /** io_xpd : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t io_xpd:1;
        /** io_thru : R/W; bitpos: [24]; default: 1;
         *  need_des
         */
        uint32_t io_thru:1;
        /** io_standby : R/W; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t io_standby:1;
        /** io_power_adjust : R/W; bitpos: [29:26]; default: 0;
         *  need_des
         */
        uint32_t io_power_adjust:4;
        uint32_t reserved_30:1;
        /** io_endet : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t io_endet:1;
    };
    uint32_t val;
} pmu_power_io_ldo_reg_t;

/** Type of power_vdd_io register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:23;
        /** io_ldo_power_sel : R/W; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t io_ldo_power_sel:1;
        /** io_ldo_sw_en_power_sel : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t io_ldo_sw_en_power_sel:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} pmu_power_vdd_io_reg_t;

/** Type of power_ck_wait_cntl register
 *  need_des
 */
typedef union {
    struct {
        /** wait_xtl_stable : R/W; bitpos: [15:0]; default: 384;
         *  need_des
         */
        uint32_t wait_xtl_stable:16;
        /** wait_pll_stable : R/W; bitpos: [31:16]; default: 256;
         *  need_des
         */
        uint32_t wait_pll_stable:16;
    };
    uint32_t val;
} pmu_power_ck_wait_cntl_reg_t;

/** Type of slp_wakeup_cntl0 register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** sleep_req : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t sleep_req:1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl0_reg_t;

/** Type of slp_wakeup_cntl1 register
 *  need_des
 */
typedef union {
    struct {
        /** sleep_reject_ena : R/W; bitpos: [30:0]; default: 0;
         *  need_des
         */
        uint32_t sleep_reject_ena:31;
        /** slp_reject_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t slp_reject_en:1;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl1_reg_t;

/** Type of slp_wakeup_cntl2 register
 *  need_des
 */
typedef union {
    struct {
        /** wakeup_ena : R/W; bitpos: [31:0]; default: 0;
         *  need_des
         */
        uint32_t wakeup_ena:32;
    };
    uint32_t val;
} pmu_slp_wakeup_cntl2_reg_t;

