espressif/esp-idf/components/soc/esp32h21/register/soc/pmu_struct_mp.h
/** Type of lp_int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** lp_cpu_wakeup_int_clr : WT; bitpos: [20]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_int_clr:1;
        /** modem_switch_active_end_int_clr : WT; bitpos: [21]; default: 0;
         *  need_des
         */
        uint32_t modem_switch_active_end_int_clr:1;
        /** sleep_switch_active_end_int_clr : WT; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_end_int_clr:1;
        /** sleep_switch_modem_end_int_clr : WT; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_modem_end_int_clr:1;
        /** modem_switch_sleep_end_int_clr : WT; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t modem_switch_sleep_end_int_clr:1;
        /** active_switch_sleep_end_int_clr : WT; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_end_int_clr:1;
        /** modem_switch_active_start_int_clr : WT; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t modem_switch_active_start_int_clr:1;
        /** sleep_switch_active_start_int_clr : WT; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_active_start_int_clr:1;
        /** sleep_switch_modem_start_int_clr : WT; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t sleep_switch_modem_start_int_clr:1;
        /** modem_switch_sleep_start_int_clr : WT; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t modem_switch_sleep_start_int_clr:1;
        /** active_switch_sleep_start_int_clr : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t active_switch_sleep_start_int_clr:1;
        /** hp_sw_trigger_int_clr : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_sw_trigger_int_clr:1;
    };
    uint32_t val;
} pmu_lp_int_clr_reg_t;

/** Type of lp_cpu_pwr0 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_waiti_rdy : RO; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_waiti_rdy:1;
        /** lp_cpu_stall_rdy : RO; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_stall_rdy:1;
        uint32_t reserved_2:16;
        /** lp_cpu_force_stall : R/W; bitpos: [18]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_force_stall:1;
        /** lp_cpu_slp_waiti_flag_en : R/W; bitpos: [19]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_waiti_flag_en:1;
        /** lp_cpu_slp_stall_flag_en : R/W; bitpos: [20]; default: 1;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_flag_en:1;
        /** lp_cpu_slp_stall_wait : R/W; bitpos: [28:21]; default: 255;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_wait:8;
        /** lp_cpu_slp_stall_en : R/W; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_stall_en:1;
        /** lp_cpu_slp_reset_en : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_reset_en:1;
        /** lp_cpu_slp_bypass_intr_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_slp_bypass_intr_en:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr0_reg_t;

/** Type of lp_cpu_pwr1 register
 *  need_des
 */
typedef union {
    struct {
        /** lp_cpu_wakeup_en : R/W; bitpos: [15:0]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_wakeup_en:16;
        uint32_t reserved_16:15;
        /** lp_cpu_sleep_req : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t lp_cpu_sleep_req:1;
    };
    uint32_t val;
} pmu_lp_cpu_pwr1_reg_t;

/** Type of hp_lp_cpu_comm register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** lp_trigger_hp : WT; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t lp_trigger_hp:1;
        /** hp_trigger_lp : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t hp_trigger_lp:1;
    };
    uint32_t val;
} pmu_hp_lp_cpu_comm_reg_t;

/** Type of hp_regulator_cfg register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** dig_regulator_en_cal : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t dig_regulator_en_cal:1;
    };
    uint32_t val;
} pmu_hp_regulator_cfg_reg_t;

/** Type of main_state register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:11;
        /** main_last_st_state : RO; bitpos: [17:11]; default: 256;
         *  need_des
         */
        uint32_t main_last_st_state:7;
        /** main_tar_st_state : RO; bitpos: [24:18]; default: 4;
         *  need_des
         */
        uint32_t main_tar_st_state:7;
        /** main_cur_st_state : RO; bitpos: [31:25]; default: 1;
         *  need_des
         */
        uint32_t main_cur_st_state:7;
    };
    uint32_t val;
} pmu_main_state_reg_t;

/** Type of pwr_state register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:13;
        /** backup_st_state : RO; bitpos: [17:13]; default: 1;
         *  need_des
         */
        uint32_t backup_st_state:5;
        /** lp_pwr_st_state : RO; bitpos: [22:18]; default: 0;
         *  need_des
         */
        uint32_t lp_pwr_st_state:5;
        /** hp_pwr_st_state : RO; bitpos: [31:23]; default: 1;
         *  need_des
         */
        uint32_t hp_pwr_st_state:9;
    };
    uint32_t val;
} pmu_pwr_state_reg_t;

/** Type of dcm_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** dsfmos_use_por : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t dsfmos_use_por:1;
        uint32_t reserved_1:21;
        /** dcdc_dcm_update : WT; bitpos: [22]; default: 0;
         *  need_des
         */
        uint32_t dcdc_dcm_update:1;
        /** dcdc_pcur_limit : R/W; bitpos: [25:23]; default: 1;
         *  need_des
         */
        uint32_t dcdc_pcur_limit:3;
        /** dcdc_bias_cal_done : RO; bitpos: [26]; default: 1;
         *  need_des
         */
        uint32_t dcdc_bias_cal_done:1;
        /** dcdc_ccm_sw_en : R/W; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ccm_sw_en:1;
        /** dcdc_vcm_enb : R/W; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t dcdc_vcm_enb:1;
        /** dcdc_ccm_rdy : RO; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t dcdc_ccm_rdy:1;
        /** dcdc_vcm_rdy : RO; bitpos: [30]; default: 1;
         *  need_des
         */
        uint32_t dcdc_vcm_rdy:1;
        /** dcdc_rdy_clr : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t dcdc_rdy_clr:1;
    };
    uint32_t val;
} pmu_dcm_ctrl_reg_t;

